Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException Constructor
Overload List
Name | Description
InvalidFilterExpressionException(Expression, InvalidFilterExpressionExceptionReasonsType)
 Initializes a new instance of the InvalidFilterExpressionException class.
InvalidFilterExpressionException(Expression, InvalidFilterExpressionExceptionReasonsType, Int32)
 Initializes a new instance of the InvalidFilterExpressionException class.
InvalidFilterExpressionException(Expression, OperatorType, Expression, InvalidFilterExpressionExceptionReasonsType)
 Initializes a new instance of the InvalidFilterExpressionException class.
Top
See Also
Reference
InvalidFilterExpressionException Class
Tekla.Structures.Filtering Namespace